sample_app/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
  	@user = User.new(user_params)
  	if @user.save